{
    "added_tokens_decoder": {},
    "auto_map": {
        "AutoTokenizer": [
            "tokenization_sigma.SigmaTokenizer",
            "tokenization_sigma.SigmaTokenizer"
        ]
    },
    "bos_token": "<|endoftext|>",
    "chat_template": "{{ bos_token }}{% for message in messages %}{{'<|' + message['role'] + '|>' + message['content'] + '<|end|>' }}{% endfor %}{% if add_generation_prompt %}{{ '<|assistant|>' }}{% else %}{{ eos_token }}{% endif %}",
    "clean_up_tokenization_spaces": true,
    "eos_token": "<|endoftext|>",
    "model_max_length": 9999999999999999999999999999999999999999,
    "pad_token": "<|endoftext|>",
    "tokenizer_class": "SigmaTokenizer"
}
